export const brojevi = [
  {
    title: "Главни контакти",
    children: [
      {
        title: "Хитна",
        number: "194",
      },
      {
        title: "Хитна",
        number: "012/662-591",
      },
      {
        title: "Централа",
        number: "012/7160-700",
      },
    ],
  },
  {
    title: "Амбуланте",
    children: [
      {
        title: "Средњево",
        number: "012/667-106",
      },
      {
        title: "Мајиловац",
        number: "012/674-109",
      },
    ],
  },
  {
    title: "Ковид",
    children: [
      {
        title: "Ковид амбуланта",
        number: "062/887-1-799",
      },
      {
        title: "Вакцинални пункт",
        number: "062/8092-608",
      },
    ],
  },
  {
    title: "Одељења",
    children: [
      {
        title: "Општа",
        number: "012/7160-705",
      },
      {
        title: "Општа - заказивање прегледа",
        number: "062/8092-721",
      },
      {
        title: "Општа - обнова терапије",
        number: "062/8092-721",
      },
      {
        title: "Општа - обнова терапије",
        number: "012/7160-705",
      },
      {
        title: "Патронажа",
        number: "012/7160-707",
      },
      {
        title: "Педијатрија",
        number: "012/7160-701",
      },
      {
        title: "Гинекологија",
        number: "012/7160-708",
      },
      {
        title: "Лабораторија",
        number: "012/7160-702",
      },
      {
        title: "Рентген и АТД",
        number: "012/7160-710",
      },

      {
        title: "ОРЛ",
        number: " 062/8092-605",
      },

      {
        title: "Офталмологија",
        number: "062/8092-610",
      },
    ],
  },
];
