import React from "react";

import { PageContainer } from "@/components/layout";
import { Title } from "@/components/generic";
import { Text } from "@chakra-ui/react";

export const About = () => {
  return (
    <PageContainer>
      <Title title="О Нама" />
      <Title title="Мисија Дома Здравља" size="sm" />
      <Text p={5}>
        Дом Здравља Велико Градиште је здравствена установа која пружа примарну
        здравствену заштиту за становнике који имају боравиште на општини Велико
        Градиште, и која пружа хитну медицинску помоћ свим особама, без обзира
        на место боравка а који су се јавили Дому Здравља и којима је та помоћ
        неопходна.
      </Text>
      <Title title="Визија Дома Здравља" size="sm" />
      <Text p={5}>
        Заједнички циљ и мера сваког успеха биће здравље свих наших суграђана.
        Тежићемо поверењу и осећају сигурности свих наших корисника. Општи
        циљеви Дома здравља биће унапређење превентивних здравствених услуга и
        побољшање здравственог стања становништва.
      </Text>
      <Title title="Историја Дома Здравља" size="sm" />
      <Text p={5}>
        На основу службене евиденције Дом здравља Велико Градиште постоји од
        1961. године, а на садашњој адреси у ул.Војводе Путника 1 од 1979.
        године.
        <br />
        <br />

        Пружа здравствену заштиту на примарном нивоу и то са следећим службама:
        <br />
        <br />
        1 - Служба здравствене заштите одраслог становништва са хитном
        медицинском помоћи, кућним давањем и поливалентном патронажом ( у оквиру
        наведене службе пружа се и здравствена заштита радника)
        <br />
        2 - Служба радилошко- лабораторијске дијагностике
        <br />
        3 - Служба здравствене заштите деце и школске деце
        <br />
        4 - Специјалистичко- консултативне служба у оквиру које се пружа
        дијагностика из следећих области: интерне медицине, физикалне медицине и
        рехабилитације, пнеумофтизиолошке заштите, офталмологије,
        оториноларингологије
        <br />
        5 - Одељење гинекологије
        <br />
        6 - Служба стоматолошке заштите
        <br />
        7 - Служба за правне, економско-финансијске и техничке послове.
        <br />
        <br />
        Дом здравља је организован тако да ради 24 сата. Збрињава становништво
        на територији општине Велико Градиште и то 25.000 становника општине,
        која покрива 27 села, али и становништво општине Голубац и Кучево због
        потреба за пружањем услуга из одређених специјалности.
        <br />
        <br />
        С обзиром да Велико Градиште има специфичан географски положај,
        треба напоменути да од пролећних до касних јесењих дана у Великом
        Градишту конфигурира велики број туриста, којима је неопходно пружање
        услуга од стране Дома здравља.
      </Text>
    </PageContainer>
  );
};
