import React from "react";

import { PageContainer } from "@/components/layout";
import { Title } from "@/components/generic";
import { Text, Heading, Box } from "@chakra-ui/react";

export const About = () => {
  return (
    <PageContainer>
      <Title title="О Нама" />
      <Title title="Руководство Дома Здравља" size="sm" />
      <Box px={5} mb={5}>
        <Heading as="h6" fontSize="20" my={2}>
          Директор
        </Heading>
        <Box p={2}>
          <Text fontSize="18" fontWeight="normal">
            Др Љиљана Стевановић
          </Text>
          <Text fontSize="14" fontStyle="italic">
            Специјалиста ОРЛ
          </Text>
        </Box>
        <Heading as="h6" fontSize="20" my={2}>
          Помоћник Директора
        </Heading>
        <Box p={2}>
          <Text fontSize="18" fontWeight="normal">
            Др Недељко Васић
          </Text>
          <Text fontSize="14" fontStyle="italic">
            Специјалиста опште медицине
          </Text>
        </Box>
        <Heading as="h6" fontSize="20" my={2}>
          Главна сестра Дома Здравља
        </Heading>
        <Box p={2}>
          <Text fontSize="18" fontWeight="normal">
            Драгана Пајић
          </Text>
          <Text fontSize="14" fontStyle="italic">
            Специјалиста струковна медицинска сестра из области јавног здравља
          </Text>
        </Box>
      </Box>
      <Title title="Мисија Дома Здравља" size="sm" />
      <Text p={5}>
        Дом Здравља Велико Градиште је здравствена установа која пружа примарну
        здравствену заштиту за становнике који имају боравиште на општини Велико
        Градиште, и која пружа хитну медицинску помоћ свим особама, без обзира
        на место боравка а који су се јавили Дому Здравља и којима је та помоћ
        неопходна.
      </Text>
      <Title title="Визија Дома Здравља" size="sm" />
      <Text p={5}>
        Заједнички циљ и мера сваког успеха биће здравље свих наших суграђана.
        Тежићемо поверењу и осећају сигурности свих наших корисника. Општи
        циљеви Дома здравља биће унапређење превентивних здравствених услуга и
        побољшање здравственог стања становништва.
      </Text>
      <Title title="Историја Дома Здравља" size="sm" />
      <Text p={5}>
        На основу службене евиденције Дом здравља Велико Градиште постоји од
        1961. године, а на садашњој адреси у ул.Војводе Путника 1 од 1979.
        године.
        <br />
        <br />
        Пружа здравствену заштиту на примарном нивоу и то са следећим службама:
        <br />
        <br />
        1 - Служба за здравствену заштиту одраслог становништва са хитном
        медисинком помоћи, кућним лечењем и поливалентном патронажом
        <br />
        2 - Служба за здравствену заштиту деце, школске деце, жена и зз из
        области денталне медицине
        <br />
        3 - Служба за радиолошку и лабораторијску дијагностику и специјалистичко
        консултативну делатност
        <br />
        4 - Служба за правне, економско-финансијске, техничке и друге сличне
        послове
        <br />
        <br />
        Дом здравља је организован тако да ради 24 сата. Збрињава становништво
        на територији општине Велико Градиште, која покрива 27 села, али и
        становништво општине Голубац и Кучево због потреба за пружањем услуга из
        одређених специјалности.
        <br />
        <br />С обзиром да Велико Градиште има специфичан географски положај,
        треба напоменути да од пролећних до касних јесењих дана у Великом
        Градишту нфигурира велики број туриста који долазе на Сребрно Језеро,
        којима је неопходно пружање услуга од стране Дома здравља.
      </Text>
    </PageContainer>
  );
};
