import React from "react";

import { PageContainer } from "@/components/layout";
import { PrimaryButton, Title } from "@/components/generic";
import { Box, Text, Flex, Image } from "@chakra-ui/react";

import Link from "next/link";

export const IzabraniLekar = () => {
  return (
    <PageContainer>
      <Title title="Упутство за проверу изабраног лекара" />
      <Box p={5}>
        <Text>
          На интернет презентацији Републичког фонда за здравствено осигурање
          објављен је сервис за проверу да ли осигураник има изабраног лекара.
          <br />
          <br />
          Приступ сервису налази се у групи Електронско пословање.
        </Text>

        <Flex
          width="100%"
          justifyContent="center"
          alignItems="center"
          my={5}
          gap={5}
          flexDirection="column"
        >
          <Link href="https://www.rfzo.rs/index.php/osiguranalica/provera-izabranog-lekara">
            <PrimaryButton>Провера изабраног лекара</PrimaryButton>
          </Link>
          <Image
            src="/images/provera_lekara.webp"
            alt="Provera izabranog lekara"
          />
        </Flex>
        <Text>
          Републичким Законом о здравственом осигурању дефинисано је питање
          изабраног лекара који се бира најмање на годину дана из области опште
          медицине или медицине рада, педијатрије, гинекологије и стоматологије
          и то на следећи начин:
          <br />
          <br />
          - за децу предшколског и школског узраста до 18 година старости
          предвиђено је да имају изабраног лекара у области педијатрије и
          стоматологије
          <br />
          - сви старији од 18 година имају право да изаберу лекара опште праксе
          или специјалисту медицине рада
          <br />
          - за жене и девојке старије од 15 година предвиђено је да имају
          изабраног гинекологa
          <br />
          - одрасли пацијенти старији од 65 година могу да изаберу стоматолога.
          <br />
          <br />
          Изабрани лекар води рачуна о свим сегментима здравља пацијента, у
          редовном је контакту са њим, боље га познаје и упућенији је у његово
          здравствено стање. Пацијент добија ефикаснију и квалитетнију
          здравствену заштиту, лакше долази до лекара, има могућност телефонског
          заказивања прегледа и поручивања рецепата, као и добијања савета
          директним разговором преко броја у ординацији, који сваки пацијент
          добија од тима који сачињавају његов изабрани лекар и медицинска
          сестра.
        </Text>
        <Text fontWeight="bold" pb={5} pt={10}>
          МОЈ ЛЕКАР
        </Text>
        <Text>
          Имате право на слободан избор лекара у неком од Домова здравља на
          подручју матичне филијале Вашег здравственог осигурања. У случају да
          Ваше пребивалиште није на подручју матичне филијале која Вам је издала
          здравствену књижицу, имате право да изаберете лекара у месту свог
          пребивалишта.
          <br />
          <br />
          Ако привремено боравите ван места свог пребивалишта (ученици и
          студенти, лица смештена у установама социјалне заштите, деца у
          хранитељским породицама) лекара бирате у месту привременог боравка,
          (док ту боравите).
          <br />
          <br />
          Лекара бирате са списка изабраних лекара, који мора бити истакнут у
          сваком Дому здравља.
          <br />
          <br />
          Лекара бирате на период од једне календарске године (од дана избора до
          31.12.текуће године). Једном датој изјави о избору лекара, продужава
          се важност аутоматски сваке календарске године, све док не дате изјаву
          о промени изабраног лекара.
        </Text>
        <Text fontWeight="bold" pb={5} pt={10}>
          ИЗБОР МОГ ЛЕКАРА
        </Text>
        <Text>
          Да бисте изабрали лекара потребно је да приликом прве посете лекару ,
          попуните и потпишете образац Изјаве о избору/промени изабраног лекара.
          <br />
          <br />
          <span style={{ fontWeight: "bold" }}>
            Изаберите лекара гинеколога
          </span>
          <br />
          Особе женског пола старије од 15 година живота имају право да поред
          изабраног лекара из области опште медицине, на исти начин изаберу и
          свог изабраног лекара гинеколога.
          <br />
          <br />
          <span style={{ fontWeight: "bold" }}>
            Изаберите лекара педијатра за Ваше малолетно дете
          </span>
          <br />
          Као родитељ, старатељ, усвојитељ или хранитељ имате право да
          попуњавањем и потписивањем изјаве, изаберете лекара педијатра за Ваше
          малолетно дете. У овим случајевима, потребно је да приликом одласка у
          Дом здравља, понесете здравствену књижицу детета, односно пунолетне
          особе о којој се старате и Вашу личну карту.
          <br />
          <br />
          <span style={{ fontWeight: "bold" }}>
            Изаберите лекара стоматолога
          </span>
          <br />
          Деца до 18 година живота,имају право и на изабраног лекара
          стоматолога. Начин избора лекара стоматолога исти је као и начин
          избора лекара педијатра и гинеколога. Такође, особе старије од 65
          година живота имају право да, поред изабраног лекара из области опште
          медицине и гинекологије, на исти начин изаберу и свог лекара
          стоматологије.
          <br />
          <br />
          <span style={{ fontWeight: "bold" }}>
            Изаберите лекара за особу која није у могућности да оде у Дом
            здравља
          </span>
          <br />
          Особа која није у могућности да одласком у Дом здравља изврши избор
          лекара (инвалидно, непокретно лице и др.) има право да Вас овласти, да
          уместо ње, попуњавањем и потписивањем изјаве, извршите избор њеног
          изабраног лекара.
          <br />
          Овлашћење мора бити у писаном облику и лично потписано од стране лица
          која га даје, али не мора бити оверено од стране надлежног органа.
          <br />У овом случају, потребно је да приликом одласка у Дом здравља,
          понесете здравствену књижицу лица које Вам је дало овлашћење, Вашу
          личну карту и овлашћење.
        </Text>
        <Text fontWeight="bold" pb={5} pt={10}>
          ДОКТОР У ЗАМЕНИ
        </Text>
        <Text>
          Ако је Ваш изабрани лекар привремено одсутан, Дом здравља је у обавези
          да Вам обезбеди лекара који привремено замењује Вашег изабраног
          лекара.
          <br />
          Уколико нисте задовољни Вашим изабраним лекаром у замени, имате право
          да након три месеца од дана замене лекара, изаберете другог лекара, и
          тада се то сматра променом изабраног лекара, Ви га можете поново
          изабрати, променом изјаве о изабраном лекару.
        </Text>
        <Text fontWeight="bold" pb={5} pt={10}>
          ПРОМЕНА ИЗАБРАНОГ ЛЕКАРА
        </Text>
        <Text>
          Промену изабраног лекара вршите попуњавањем и потписивањем обрасца
          Изјава о избору/промени изабраног лекара.
          <br />
          Особа која није у могућности да оде у Дом здравља, врши промену
          изабраног лекара на исти начин као што је извршила избор изабраног
          лекара (давањем овлашћења за промену изабраног лекара).
          <br />
          Имате право да промените изабраног лекара по истеку календарске
          године, без навођења разлога промене.
          <br />
          Уколико вршите промену изабраног лекара пре истека календарске године,
          у изјави морате да наведете разлоге промене.
          <br />
          Промену изабраног лекара пре истека календарске године можете учинити
          из следећих разлога:
          <br />
          <br />
          1. у случају престанка радног односа изабраног лекара у том Дому
          здравља;
          <br />
          2. ако промените пребивалиште;
          <br />
          3. ако сте незадовољни лекаром који замењује Вашег изабраног лекара,
          по истеку рока од три месеца од дана обезбеђивања замене лекара;
          <br />
          4. ако је Ваш изабрани лекар одсутан дуже од шест месеци;
          <br />
          5. ако је дошло до неспоразума са лекаром, због кога сте изгубили
          поверење у свог изабраног лекара;
          <br />
          6. из других оправданих разлога.
          <br />
          <br />
          Уколико сте незадовољни Вашим изабраним или лекаром који Вам је
          додељен као замена, можете захтевати промену изабраног лекара и мимо
          наведених рокова.
          <br />
          Оправданост Ваших захтева цени надлежни орган у Дому здравља. Он
          утврђује све битне околности и чињенице изнете у Вашем захтеву за
          промену лекара. Дом здравља је дужан да Вам у року од 8 дана од дана
          подношења Вашег захтева, достави свој налаз.
        </Text>
        <Text fontWeight="bold" pb={5} pt={10}>
          ДУЖНОСТИ ИЗАБРАНОГ ЛЕКАРА
        </Text>
        <Text>
          Мој лекар је дужан да:
          <br />
          <br />
          1. организује и спроводи мере на очувању и унапређењу мог здравља;
          <br />
          2. обавља прегледе и дијагностику која ми је неопходна;
          <br />
          3. одређује начин и врсту мог лечења, прати ток лечења и усклађује
          мишљење и предлоге за наставак мог лечења;
          <br />
          4. упућује ме на амбулантно-специјалистичке прегледе или на
          стационарно лечење;
          <br />
          5. одређује врсту и дужину мог кућног лечења и прати његово
          спровођење;
          <br />
          6. прописује ми лекове и медицинска средства, као и одређене врсте
          медицинско-техничких помагала;
          <br />
          7. води прописану медицинску документацију о мом стању и лечењу;
          <br />
          8. даје оцену о мом здравственом стању и упућује ме на оцену радне
          способности, односно инвалидности;
          <br />
          9. утврђује дужину моје привремене спречености за рад због болести или
          повреде, до 30 дана спречености за рад и предлаже првостепеној
          лекарској комисији продужење привремене спречености за рад;
          <br />
          10. утврђује потребу да имам пратиоца за време путовања;
          <br />
          11. утврђује потребу мог одсуствовања са посла ради неге ужег члана
          породице;
          <br />
          12. даје налаз и мишљење о мом здравственом стању на основу чега ми се
          издаје потврда о коришћењу здравствене заштите у иностранству;
          <br />
          13. одређује употребу и врсту превозног средства за превоз болесника,
          обзиром на здравствено стање;
          <br />
          14. врши друге послове у вези са остваривањем мојих права из
          здравственог осигурања.
        </Text>
        <Text fontWeight="bold" pb={5} pt={10}>
          СПИСАК ИЗАБРАНИХ ЛЕКАРА ЗА ОДРЕЂЕНУ СЛУЖБУ МОЖЕТЕ НАЋИ НА СТРАНИЦИ
          СВАКЕ ПОЈЕДИНАЧНЕ СЛУЖБЕ
        </Text>
      </Box>
    </PageContainer>
  );
};
