import { RadnoVreme } from "./types";

export const radno_vreme: RadnoVreme[] = [
  {
    name: "Амбуланте Мајиловац и Средњево",
    hours: [{ name: "Радним данима", time: "7:00 - 14:00" }],
  },
  {
    name: "Служба за здравствену заштиту одраслог становништва",
    hours: [
      { name: "Радним данима", time: "7:00 - 20:00" },
      { name: "Суботом и Недељом", time: "8:00 - 18:00" },
    ],
    dezurstvo: [
      { name: "Радним данима", time: "20:00 - 7:00" },
      { name: "Суботом и Недељом", time: "18:00 - 8:00" },
    ],
  },
  {
    name: "Служба за здравствену заштиту деце и школске деце",
    hours: [
      { name: "Понедељак, Среда, Петак", time: "7:00 - 15:00" },
      { name: "Уторак и Четвртак", time: "7:00 - 20:00" },
      { name: "Субота", time: "8:00 - 14:00" },
    ],
  },
  {
    name: "Oдељење денталне медицине",
    hours: [
      { name: "Радним данима", time: "7:00 - 20:00" },
      { name: "Суботом и Празницима", time: "8:00 - 14:00" },
    ],
  },
  {
    name: "Oдсек за здраствену заштиту жена",
    hours: [
      {
        name: "Радним данима",
        time: "7:00 - 15:00",
      },
    ],
  },
  {
    name: "Oдељење лабораторијске дијагностике",
    hours: [
      {
        name: "Радним данима",
        time: "7:00 - 14:00",
      },
      {
        name: "Суботом",
        time: "8:00 - 12:00",
      },
    ],
  },
  {
    name: "Офталмолошка амбуланта",
    hours: [
      {
        name: "Радним данима",
        time: "7:00 - 15:00",
      },
    ],
  },
  {
    name: "ОРЛ амбуланта",
    hours: [
      {
        name: "Радним данима",
        time: "7:00 - 15:00",
      },
    ],
  },
  {
    name: "Интерна медицина",
    hours: [
      {
        name: "Радним данима",
        time: "7:00 - 20:00",
      },
    ],
  },
  {
    name: "Физикална медицина и рехабилитација",
    hours: [
      {
        name: "Понедељак, Среда, Петак",
        time: "7:00 - 14:00",
      },
    ],
  },
  {
    name: "Служба за правне, економско-финансијске и техничке послове",
    hours: [
      {
        name: "Радним данима",
        time: "7:00 - 15:00",
      },
    ],
  },
];
