import { KalendarZdravlja } from "./types";

export const kalendar_zdravlja: KalendarZdravlja = [
  {
    name: "Јануар",
    desc: "",
    days: [
      {
        day: "21.01.-28.01.",
        title: "Европска недеља превенције рака грлића материце",
      },
      { day: "31.01.", title: "Национални дан без дуванског дима" },
    ],
  },
  {
    name: "Фебруар",
    desc: "",
    days: [{ day: "4.2.", title: "Светски дан борбе против рака" }],
  },
  {
    name: "Март",
    desc: "Национални месец борбе против рака",
    days: [
      { day: "8.3.", title: "Дан женских права" },
      { day: "22.3.", title: "Светски дан вода" },
      { day: "24.3.", title: "Светски дан борбе против туберкулозе" },
    ],
  },
  {
    name: "Април",
    desc: "",
    days: [
      { day: "7.4.", title: "Светски дан здравља" },
      { day: "12.4.", title: "Одвикавање од пушења - Остави и победи" },
      { day: "20.4.", title: "Међународни дан заштите од буке" },
      { day: "22.4.", title: "Дан планете Земље" },
      { day: "28.4.", title: "Светски дан безбедности на раду" },
      { day: "Трећа недеља", title: "Европска недеља имунизације" },
      {
        day: "Четврта недеља",
        title: "Недеља превенције повреда у саобраћају",
      },
    ],
  },
  {
    name: "Мај",
    desc: "",
    days: [
      { day: "05.05.", title: "Међународни дан бабица" },
      { day: "10.05.", title: "Међународни дан физичке активности" },
      { day: "11.05.", title: "Национални дан добровољних давалаца крви" },
      { day: "12.05.", title: "Међународни дан сестринства" },
      { day: "15.05.", title: "Међународни дан породице" },
      { day: "16.05.", title: "Дан сећања на преминуле од сиде" },
      { day: "20.05.", title: "Дан здравих градова" },
      { day: "31.05.", title: "Међународни дан биолошке разноврсности" },
      { day: "31.05.", title: "Светски дан без дуванског дима" },
      { day: "Трећа недеља", title: "Национална недеља здравља уста и зуба" },
    ],
  },
  {
    name: "Јун",
    desc: "",
    days: [
      { day: "5.06.", title: "Светски дан човекове околине" },
      { day: "14.06.", title: "Светски дан добровољних давалаца крви" },
      {
        day: "26.06.",
        title: "Медународни дан против злоупотребе и кријумчарења дроге",
      },
    ],
  },
  {
    name: "Јул",
    desc: "",
    days: [{ day: "11.07.", title: "Светски дан становништва" }],
  },
  {
    name: "Август",
    desc: "",
    days: [
      { day: "Прва недеља", title: "Светска недеља дојења" },
      { day: "12.8.", title: "Међународни дан младих" },
    ],
  },
  {
    name: "Септембар",
    desc: "",
    days: [
      { day: "10.09.", title: "Светски дан превенције самоубистава" },
      { day: "11.09.", title: "Светски дан прве помоћи" },
      {
        day: "24.09.",
        title: "Светски дан срца (недеља у трећој недељи септембра)",
      },
      {
        day: "Четрдесета недеља у години",
        title: "Национална недеља промоције дојења",
      },
    ],
  },
  {
    name: "Октобар",
    desc: "Национални месец правилне исхране",
    days: [
      { day: "01.10.", title: "Међународни дан старих" },
      { day: "10.10.", title: "Светски дан менталног здравља" },
      { day: "15.10.", title: "Светски дан ЧИСТИХ РУКУ" },
      { day: "16.10.", title: "Светски дан хране" },
      { day: "17.10.", title: "Међународни дан борбе против сиромаштва" },
    ],
  },
  {
    name: "Новембар",
    desc: "",
    days: [
      { day: "14.11.", title: "Светски дан борбе против шећерне болести" },
      {
        day: "15.11. ",
        title: "Међународни дан борбе против опструктивне болести плућа",
      },
      { day: "20.11.", title: "Међународни дан детета" },
    ],
  },
  {
    name: "Децембар",
    desc: "",
    days: [
      { day: "01.12.", title: "Светски дан борбе против ХИВ/АИДС" },
      { day: "14.12.", title: "Дан чистих руку" },
    ],
  },
];
